gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_modules/generic_module/amod_api.c
/*
 * Copyright(c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include "amod_api.h"

#include <stdlib.h>
#include <stdio.h>
#include <ctype.h>
#include <zephyr/kernel.h>
#include <zephyr/shell/shell.h>
#include <nrfx_clock.h>
#include "data_fifo.h"

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(module_api, 4); /* CONFIG_MODULE_API_LOG_LEVEL); */

/**
 * @brief Helper function to validate the module description.
 *
 * @param parameters  The module parameters
 *
 * @return 0 if successful, error value
 */
static int validate_parameters(struct amod_parameters *parameters)
{
	if (parameters == NULL) {
		LOG_DBG("No description for module");
		return -EINVAL;
	}

	if ((parameters->description->type != AMOD_TYPE_INPUT &&
	     parameters->description->type != AMOD_TYPE_OUTPUT &&
	     parameters->description->type != AMOD_TYPE_PROCESSOR) ||
	    parameters->description->name == NULL || parameters->description->functions == NULL) {
		LOG_DBG("Error in description for module");
		return -EINVAL;
	}

	return 0;
}

/**
 * @brief General callback for releasing the audio block when intermodule block
 *        passing.
 *
 * @param handle  The handle of the sending modules instance
 * @param block   Pointer to the audio data block to send to the module
 */
void block_release(struct amod_handle *handle, struct aobj_block *block)
{
	k_sem_take(&handle->sem, K_NO_WAIT);

	if (k_sem_count_get(&handle->sem) == 0) {
		/* Object data has been consumed by all modules so now can free the memory */
		k_mem_slab_free(handle->thread.data_slab, (void **)block->data);
	}
}

/**
 * @brief Send a data buffer to a module, all data is consumed by the module.
 *
 * @param tx_handle    The handle for the sending module instance
 * @param rx_handle    The handle for the receiving module instance
 * @param block        Pointer to the audio data block to send to the module
 * @param response_cb  A pointer to a callback to run when the buffer is
 *                     fully comsumed
 *
 * @return 0 if successful, error value
 */
static int data_tx(struct amod_handle *tx_handle, struct amod_handle *rx_handle,
		   struct aobj_block *block, amod_response_cb data_in_response_cb)
{
	int ret;
	struct amod_message *data_msg_rx;

	ret = data_fifo_pointer_first_vacant_get(rx_handle->thread.msg_rx, (void **)&data_msg_rx,
						 K_NO_WAIT);
	if (ret) {
		LOG_DBG("Module %s no free data buffer, ret %d", rx_handle->name, ret);
		return ret;
	}

	/* fill data */
	memcpy(&data_msg_rx->block, block, sizeof(struct aobj_block));
	data_msg_rx->tx_handle = tx_handle;
	data_msg_rx->response_cb = data_in_response_cb;

	ret = data_fifo_block_lock(rx_handle->thread.msg_rx, (void **)&data_msg_rx,
				   sizeof(struct amod_message));
	if (ret) {
		data_fifo_block_free(rx_handle->thread.msg_rx, (void **)&data_msg_rx);

		LOG_DBG("Module %s failed to return output buffer, ret %d", rx_handle->name, ret);
		return ret;
	}

	LOG_DBG("Data sent to module %s", rx_handle->name);

	return 0;
}

/**
 * @brief Function to clean up items if a procedure fails.
 *
 */
static void clean_up(struct amod_handle *handle, struct amod_message **msg_rx,
		     struct amod_message **msg_tx, char **data)
{
	if ((*msg_rx)->response_cb != NULL) {
		(*msg_rx)->response_cb((*msg_rx)->tx_handle, &(*msg_rx)->block);
	}

	if ((*msg_rx) != NULL) {
		data_fifo_block_free(handle->thread.msg_rx, (void **)(*msg_rx));
	}

	if ((*msg_tx) != NULL) {
		data_fifo_block_free(handle->thread.msg_tx, (void **)(*msg_tx));
	}

	if ((*data) != NULL) {
		k_mem_slab_free(handle->thread.data_slab, (void **)(*data));
	}
}

/**
 * @brief The thread that receives data from outside the system and passes it into the audio system.
 *
 * @param handle  The handle for this modules instance
 *
 * @return 0 if successful, error value
 */
static int module_thread_input(struct amod_handle *handle)
{
	int ret;

	struct amod_handle *handle_to;
	struct amod_message *msg_rx = NULL;
	struct amod_message *msg_tx;
	char *data;

	if (handle == NULL) {
		LOG_DBG("Error in the module task as handle NULL");
		return -EINVAL;
	}

	/* Execute thread */
	while (1) {
		msg_tx = NULL;
		data = NULL;

		if (handle->description->functions->data_process != NULL) {
			/* Get a new output buffer */
			ret = k_mem_slab_alloc(handle->thread.data_slab, (void **)&data, K_FOREVER);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("No free data buffer for module %st, ret %d", handle->name,
					ret);
				continue;
			}

			ret = data_fifo_pointer_first_vacant_get(handle->thread.msg_tx,
								 (void **)&msg_tx, K_FOREVER);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("No free message for module %s, ret %d", handle->name, ret);
				continue;
			}

			/* Configure new audio block */
			msg_tx->block.data = data;
			msg_tx->block.data_size = handle->thread.data_size;

			/* Process the input audio block */
			ret = handle->description->functions->data_process((struct handle *)handle,
									   NULL, &msg_tx->block);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("Data process error in module %s, ret %d", handle->name,
					ret);
				continue;
			}

			/* Send input audio block to next module(s) */
			if (!sys_slist_is_empty(&handle->hdl_dest_list)) {
				k_mutex_lock(&handle->dest_mutex, K_FOREVER);
				k_sem_init(&handle->sem, handle->dest_count, handle->dest_count);

				SYS_SLIST_FOR_EACH_CONTAINER(&handle->hdl_dest_list, handle_to,
							     node) {
					ret = data_tx(handle, handle_to, &msg_tx->block,
						      &block_release);
					if (ret) {
						LOG_DBG("Failed to send to module %s from %s",
							handle_to->name, handle->name);
						k_sem_take(&handle->sem, K_NO_WAIT);
					}
				}

				k_mutex_unlock(&handle->dest_mutex);
			}

			if (handle->msg_out) {
				/* Send audio block to modules output message queue */
				ret = data_fifo_block_lock(handle->thread.msg_tx, (void **)&msg_tx,
							   sizeof(struct amod_message));
				if (ret) {
					clean_up(handle, &msg_rx, &msg_tx, &data);

					LOG_DBG("Module %s failed to return output buffer, ret %d",
						handle->name, ret);

					k_sem_take(&handle->sem, K_NO_WAIT);
					continue;
				}
			}
		} else {
			LOG_DBG("No process function for module %s, discarding input",
				handle->name);
		}
	}

