gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_modules/generic_module/amod_api.c
	return 0;
}

/**
 * @brief The thread that processes inputs and outputs them out of the audio system.
 *
 * @param handle  The handle for this modules instance
 *
 * @return 0 if successful, error value
 */
static int module_thread_output(struct amod_handle *handle)
{
	int ret;

	struct amod_message *msg_rx;
	struct amod_message *msg_tx = NULL;
	char *data = NULL;
	size_t size;

	if (handle == NULL) {
		LOG_DBG("Error in the module task as handle NULL");
		return -EINVAL;
	}

	/* Execute thread */
	while (1) {
		msg_rx = NULL;

		ret = data_fifo_pointer_last_filled_get(handle->thread.msg_rx, (void **)&msg_rx,
							&size, K_FOREVER);
		if (ret) {
			LOG_DBG("No new data for module %s, ret %d", handle->name, ret);
			continue;
		}

		if (handle->description->functions->data_process != NULL) {
			/* Process the input audio block and output from the audio system */
			ret = handle->description->functions->data_process((struct handle *)handle,
									   &msg_rx->block, NULL);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("Data process error in module %s, ret %d", handle->name,
					ret);
				continue;
			}

			if (msg_rx->response_cb != NULL) {
				msg_rx->response_cb(msg_rx->tx_handle, &msg_rx->block);
			}

		} else {
			LOG_DBG("No process function for module %s, discarding input",
				handle->name);
		}

		data_fifo_block_free(handle->thread.msg_rx, (void **)&msg_rx);
	}

	return 0;
}

/**
 * @brief The thread that processes inputs and returns data from the module
 *
 * @param handle  The handle for this modules instance
 *
 * @return 0 if successful, error value
 */
static int module_thread_processor(struct amod_handle *handle)
{
	int ret;

	struct amod_handle *handle_to;
	struct amod_message *msg_rx;
	struct amod_message *msg_tx;
	char *data = NULL;
	size_t size;

	if (handle == NULL) {
		LOG_DBG("Error in the module task as handle NULL");
		return -EINVAL;
	}

	/* Execute thread */
	while (1) {
		msg_rx = NULL;
		msg_tx = NULL;
		data = NULL;

		ret = data_fifo_pointer_last_filled_get(handle->thread.msg_rx, (void **)&msg_rx,
							&size, K_FOREVER);
		if (ret) {
			LOG_DBG("No new message for module %s, ret %d", handle->name, ret);
			continue;
		}

		if (handle->description->functions->data_process != NULL) {
			/* Get a new output buffer from outside the audio system */
			ret = k_mem_slab_alloc(handle->thread.data_slab, (void **)&data, K_NO_WAIT);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("No free data buffer for module %s, dropping input, ret %d",
					handle->name, ret);
				continue;
			}

			ret = data_fifo_pointer_first_vacant_get(handle->thread.msg_tx,
								 (void **)&msg_tx, K_NO_WAIT);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("No free message for module %s, dropping input, ret %d",
					handle->name, ret);
				continue;
			}

			/* Configure new audio block */
			msg_tx->block.data = data;
			msg_tx->block.data_size = handle->thread.data_size;

			/* Process the input audio block into the output audio block */
			ret = handle->description->functions->data_process(
				(struct handle *)handle, &msg_rx->block, &msg_tx->block);
			if (ret) {
				clean_up(handle, &msg_rx, &msg_tx, &data);

				LOG_DBG("Data process error in module %s, ret %d", handle->name,
					ret);
				continue;
			}

			/* Send output audio block to next module(s) */
			if (!sys_slist_is_empty(&handle->hdl_dest_list)) {
				k_mutex_lock(&handle->dest_mutex, K_FOREVER);
				k_sem_init(&handle->sem, handle->dest_count, handle->dest_count);

				SYS_SLIST_FOR_EACH_CONTAINER(&handle->hdl_dest_list, handle_to,
							     node) {
					ret = data_tx(handle, handle_to, &msg_tx->block,
						      &block_release);
					if (ret) {
						LOG_DBG("Failed to send to module %s from %s",
							handle_to->name, handle->name);

						k_sem_take(&handle->sem, K_NO_WAIT);
					}
				}

				k_mutex_unlock(&handle->dest_mutex);
			}

			if (handle->msg_out) {
				/* Send audio block to modules output message queue */
				ret = data_fifo_block_lock(handle->thread.msg_tx, (void **)&msg_tx,
							   sizeof(struct amod_message));
				if (ret) {
					clean_up(handle, &msg_rx, &msg_tx, &data);

					LOG_DBG("Module %s failed to return output buffer, ret %d",
						handle->name, ret);

					k_sem_take(&handle->sem, K_NO_WAIT);
					continue;
				}
			}

			if (msg_rx->response_cb != NULL) {
				msg_rx->response_cb(msg_rx->tx_handle, &msg_rx->block);
			}

		} else {
			LOG_DBG("No process function for module %s, discarding input",
				handle->name);
		}

		data_fifo_block_free(handle->thread.msg_rx, (void **)&msg_rx);
	}

	return 0;
}
/**
 * @brief  Function for querying the resources required for a module.
 */
int amod_query_resource(struct amod_parameters *parameters,
			struct amod_configuration *configuration)
{
	int ret;
	int size = 0;

	ret = validate_parameters(parameters);
	if (ret) {
		LOG_DBG("Invalid parameters for module, returned %d", ret);
		return ret;
	}

	if (parameters->description->functions->query_resource != NULL) {
		size = parameters->description->functions->query_resource(configuration);
		if (size < 0) {
			LOG_DBG("Failed query resource for module %s, ret %d",
				parameters->description->name, size);
			return -EFAULT;
		}
	} else {
		LOG_DBG("No query resource function for module %s", parameters->description->name);
	}

	size += WB_UP(sizeof(struct amod_handle));

	return size;
};

/**
 * @brief  Function for opening a module.
 */
int amod_open(struct amod_parameters *parameters, struct amod_configuration *configuration,
	      char *name, struct amod_handle *handle, struct amod_context *context)
{
	int ret;

	if (handle == NULL) {
		LOG_DBG("Input handle parameter is NULL for module %s in the open function", name);
		return -EINVAL;
	}

	if (handle->state == AMOD_STATE_OPEN) {
		LOG_DBG("Module %s is already open", handle->name);
		return -EALREADY;
	}

	ret = validate_parameters(parameters);
	if (ret) {
		LOG_DBG("Invalid parameters for module, ret %d", ret);
		return ret;
	}

	memset(handle, 0, sizeof(struct amod_handle));

