gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_modules/generic_module/amod_api.c
	handle->description->type = parameters->description->type;

	handle->previous_state = AMOD_STATE_UNDEFINED;
	handle->state = AMOD_STATE_UNDEFINED;

	/* Allocate the context memory */
	handle->context = context;

	memcpy(handle->name, name, AMOD_NAME_SIZE);
	handle->description = parameters->description;
	memcpy(&handle->thread, &parameters->thread, sizeof(struct amod_thread_configuration));

	sys_slist_init(&handle->hdl_dest_list);
	k_mutex_init(&handle->dest_mutex);

	if (handle->description->functions->open != NULL) {
		ret = handle->description->functions->open((struct handle *)handle, configuration);
		if (ret) {
			LOG_DBG("Failed open call to module %s, ret %d", name, ret);
			return ret;
		}
	}

	switch (handle->description->type) {
	case AMOD_TYPE_INPUT:
		handle->thread_id =
			k_thread_create(&handle->thread_data, handle->thread.stack,
					handle->thread.stack_size,
					(k_thread_entry_t)module_thread_input, handle, NULL, NULL,
					K_PRIO_PREEMPT(handle->thread.priority), 0, K_FOREVER);

		ret = k_thread_name_set(handle->thread_id, handle->name);
		if (ret) {
			LOG_DBG("Failed to start input module %s thread, ret %d", handle->name,
				ret);
			return ret;
		}

		break;

	case AMOD_TYPE_OUTPUT:
		handle->thread_id =
			k_thread_create(&handle->thread_data, handle->thread.stack,
					handle->thread.stack_size,
					(k_thread_entry_t)module_thread_output, handle, NULL, NULL,
					K_PRIO_PREEMPT(handle->thread.priority), 0, K_FOREVER);

		ret = k_thread_name_set(handle->thread_id, handle->name);
		if (ret) {
			LOG_DBG("Failed to start output module %s thread, ret %d", handle->name,
				ret);
			return ret;
		}

		break;

	case AMOD_TYPE_PROCESSOR:
		handle->thread_id = k_thread_create(
			&handle->thread_data, handle->thread.stack, handle->thread.stack_size,
			(k_thread_entry_t)module_thread_processor, handle, NULL, NULL,
			K_PRIO_PREEMPT(handle->thread.priority), 0, K_FOREVER);

		ret = k_thread_name_set(handle->thread_id, handle->name);
		if (ret) {
			LOG_DBG("Failed to start processor module %s thread, ret %d", handle->name,
				ret);
			return ret;
		}

		break;

	default:
		LOG_DBG("Invalid module type %d for module %s", handle->description->type,
			handle->name);
		return -EINVAL;
	}

	k_thread_start(handle->thread_id);

	handle->state = AMOD_STATE_OPEN;

	LOG_DBG("Module %s is now open", handle->name);

	return 0;
}

/**
 * @brief  Function to close an open module.
 */
int amod_close(struct amod_handle *handle)
{
	int ret;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (handle->state == AMOD_STATE_RUNNING) {
		LOG_DBG("Module %s in an invalid state, %d, for close", handle->name,
			handle->state);
		return -ENOTSUP;
	}

	if (handle->description->functions->close != NULL) {
		ret = handle->description->functions->close((struct handle *)handle);
		if (ret) {
			LOG_DBG("Failed close call to module %s, returned %d", handle->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("Module %s has no close function", handle->name);
	}

	data_fifo_empty(handle->thread.msg_rx);
	data_fifo_empty(handle->thread.msg_tx);

	k_thread_abort(handle->thread_id);

	handle->state = AMOD_STATE_UNDEFINED;

	return 0;
};

/**
 * @brief  Function to set the configuration of a module.
 */
int amod_configuration_set(struct amod_handle *handle, struct amod_configuration *configuration)
{
	int ret;

	if (handle == NULL || configuration == NULL) {
		LOG_DBG("Module input parameter error");
		return -EINVAL;
	}

	if (handle->state == AMOD_STATE_UNDEFINED || handle->state == AMOD_STATE_RUNNING) {
		LOG_DBG("Module %s in an invalid state, %d, for setting the configuration",
			handle->name, handle->state);
		return -ENOTSUP;
	}

	if (handle->description->functions->configuration_set != NULL) {
		ret = handle->description->functions->configuration_set((struct handle *)handle,
									configuration);
		if (ret) {
			LOG_DBG("Set configuration for module %s send failed, ret %d", handle->name,
				ret);
			return ret;
		}
	} else {
		LOG_DBG("No set configuration function for module %s", handle->name);
	}

	handle->previous_state = handle->state;
	handle->state = AMOD_STATE_CONFIGURED;

	return 0;
};

/**
 * @brief  Function to get the configuration of a module.
 */
int amod_configuration_get(struct amod_handle *handle, struct amod_configuration *configuration)
{
	int ret;

	if (handle == NULL || configuration == NULL) {
		LOG_DBG("Module input parameter error");
		return -EINVAL;
	}

	if (handle->state == AMOD_STATE_UNDEFINED || handle->state == AMOD_STATE_OPEN) {
		LOG_DBG("Module %s in an invalid state, %d, for getting the configuration",
			handle->name, handle->state);
		return -ENOTSUP;
	}

	if (handle->description->functions->configuration_get != NULL) {
		ret = handle->description->functions->configuration_get((struct handle *)handle,
									configuration);
		if (ret) {
			LOG_DBG("Get configuration for module %s failed, ret %d", handle->name,
				ret);
			return ret;
		}
	} else {
		LOG_DBG("No get configuration function for module %s", handle->name);
		return -ENOSYS;
	}

	return 0;
};

/**
 * @brief Function to connect two modules together.
 *
 */
int amod_connect(struct amod_handle *handle_from, struct amod_handle *handle_to)
{
	if (handle_from == NULL || handle_to == NULL) {
		LOG_DBG("Invalid paramet for the connection function");
		return -EINVAL;
	}

	if (handle_from->description->type == AMOD_TYPE_OUTPUT ||
	    handle_to->description->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Connections between these modules, %s to %s, is not supported",
			handle_from->name, handle_to->name);
		return -ENOTSUP;
	}

	if (handle_from->state == AMOD_STATE_UNDEFINED ||
	    handle_to->state == AMOD_STATE_UNDEFINED) {
		LOG_DBG("A module is in an invalid state for connecting modules %s to %s",
			handle_from->name, handle_to->name);
		return -ENOTSUP;
	}

	k_mutex_lock(&handle_from->dest_mutex, K_FOREVER);

	if (handle_from == handle_to) {
		handle_from->msg_out = true;
		handle_from->dest_count += 1;
	} else {
		sys_slist_append(&handle_from->hdl_dest_list, &handle_to->node);
		handle_from->dest_count += 1;
	}

