gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_modules/generic_module/amod_api.c
	k_mutex_unlock(&handle_from->dest_mutex);

	return 0;
}

/**
 * @brief Function to disconnect a module.
 *
 */
int amod_disconnect(struct amod_handle *handle, struct amod_handle *handle_disconnect)
{
	if (handle == NULL || handle_disconnect == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (handle->description->type == AMOD_TYPE_OUTPUT ||
	    handle_disconnect->description->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Connections between these modules, %s to %s, is not supported",
			handle->name, handle_disconnect->name);
		return -ENOTSUP;
	}

	if (handle->state == AMOD_STATE_UNDEFINED || handle->state == AMOD_STATE_OPEN) {
		LOG_DBG("A module is an invalid state or type for disconnection");
		return -ENOTSUP;
	}

	k_mutex_lock(&handle->dest_mutex, K_FOREVER);

	if (!sys_slist_find_and_remove(&handle->hdl_dest_list, &handle_disconnect->node)) {
		LOG_DBG("Connection of module %s has not been found for module %s",
			handle_disconnect->name, handle->name);
		return -EINVAL;
	}

	handle->dest_count -= 1;

	k_mutex_unlock(&handle->dest_mutex);

	return 0;
}

/**
 * @brief Start a module processing data.
 */
int amod_start(struct amod_handle *handle)
{
	int ret;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (handle->state == AMOD_STATE_UNDEFINED || handle->state == AMOD_STATE_RUNNING ||
	    handle->state == AMOD_STATE_OPEN) {
		LOG_DBG("Module %s in an invalid state, %d, for set configuration", handle->name,
			handle->state);
		return -ENOTSUP;
	}

	if (handle->description->functions->start != NULL) {
		ret = handle->description->functions->start((struct handle *)handle);
		if (ret < 0) {
			LOG_DBG("Failed user start for module %s, ret %d", handle->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No user start function for module %s", handle->name);
	}

	handle->previous_state = handle->state;
	handle->state = AMOD_STATE_RUNNING;

	return 0;
}

/**
 * @brief Pause a module processing data.
 */
int amod_pause(struct amod_handle *handle)
{
	int ret;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (handle->state != AMOD_STATE_RUNNING) {
		LOG_DBG("Module %s in an invalid state, %d, for set configuration", handle->name,
			handle->state);
		return -ENOTSUP;
	}

	if (handle->description->functions->pause != NULL) {
		ret = handle->description->functions->pause((struct handle *)handle);
		if (ret < 0) {
			LOG_DBG("Failed user pause for module %s, ret %d", handle->name, ret);
			return ret;
		}
	} else {
		LOG_DBG("No user pause function for module %s", handle->name);
	}

	handle->previous_state = handle->state;
	handle->state = AMOD_STATE_PAUSED;

	return 0;
}

/**
 * @brief Send a data buffer to a module.
 */
int amod_data_tx(struct amod_handle *handle, struct aobj_block *block, amod_response_cb response_cb)
{
	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (block == NULL) {
		LOG_DBG("Module , %s, data parameter error", handle->name);
		return -ECONNREFUSED;
	}

	if (handle->state != AMOD_STATE_RUNNING || handle->description->type == AMOD_TYPE_INPUT) {
		LOG_DBG("Module %s in an invalid state (%d) or type (%d) to send data",
			handle->name, handle->state, handle->description->type);
		return -ENOTSUP;
	}

	return data_tx((void *)NULL, handle, block, response_cb);
}

/**
 * @brief Retrieve data from the module.
 *
 */
int amod_data_rx(struct amod_handle *handle, struct aobj_block *block, k_timeout_t timeout)
{
	int ret;

	struct amod_message *msg_tx;
	size_t msg_tx_size;

	if (handle == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (handle->state != AMOD_STATE_RUNNING || handle->description->type == AMOD_TYPE_OUTPUT) {
		LOG_DBG("Module %s in an invalid state (%d) or type (%d) to receive data",
			handle->name, handle->state, handle->description->type);
		return -ENOTSUP;
	}

	if (block == NULL) {
		LOG_DBG("Error in output block for module %s", handle->name);
		return -ECONNREFUSED;
	}

	ret = data_fifo_pointer_last_filled_get(handle->thread.msg_tx, (void **)&msg_tx,
						&msg_tx_size, timeout);
	if (ret) {
		LOG_DBG("Failed to retrieve data from module %s, ret %d", handle->name, ret);
		return ret;
	}

	if (block->data == NULL || msg_tx->block.data_size > block->data_size) {
		LOG_DBG("Data output buffer too small for received buffer from module %s",
			handle->name);
		ret = -EINVAL;
	} else {
		uint8_t *data_out = block->data;

		memcpy(block, &msg_tx->block, sizeof(struct aobj_block));
		memcpy(data_out, msg_tx->block.data, msg_tx->block.data_size);

		ret = 0;
	}

	block_release(handle, &msg_tx->block);

	data_fifo_block_free(handle->thread.msg_tx, (void **)&msg_tx);

	return ret;
}

/**
 * @brief Send data and retrieve the processed data from the module.
 */
int amod_data_rx_tx(struct amod_handle *handle_tx, struct amod_handle *handle_rx,
		    struct aobj_block *block_tx, struct aobj_block *block_rx, k_timeout_t timeout)
{
	int ret;
	struct amod_message *msg_tx;
	size_t msg_tx_size;

	if (handle_tx == NULL || handle_rx == NULL) {
		LOG_DBG("Module handle is NULL");
		return -EINVAL;
	}

	if (handle_tx->state != AMOD_STATE_RUNNING || handle_rx->state != AMOD_STATE_RUNNING) {
		LOG_DBG("Module is in an invalid state or type to send-receive data");
		return -ENOTSUP;
	}

	if (handle_tx->description->type == AMOD_TYPE_INPUT ||
	    handle_rx->description->type == AMOD_TYPE_OUTPUT) {
		LOG_DBG("Module noyt of the right type for operation");
		return -EINVAL;
	}

	if (block_tx == NULL || block_rx == NULL) {
		LOG_DBG("Error in audio block pointer for module");
		return -ECONNREFUSED;
	}

	if (block_tx->data == NULL || block_tx->data_size == 0 || block_rx->data == NULL ||
	    block_rx->data_size == 0) {
		LOG_DBG("Error in output audio block");
		return -ECONNREFUSED;
	}

	ret = data_tx(NULL, handle_tx, block_tx, NULL);
	if (ret) {
		LOG_DBG("Failed to send data to module %s, ret %d", handle_tx->name, ret);
		return ret;
	}

	ret = data_fifo_pointer_last_filled_get(handle_rx->thread.msg_tx, (void **)&msg_tx,
						&msg_tx_size, timeout);
	if (ret) {
		LOG_DBG("Failed to retrieve data from module %s, ret %d", handle_rx->name, ret);
		return ret;
	}

	if (msg_tx->block.data == NULL || msg_tx->block.data_size == 0) {
		LOG_DBG("Data output buffer too small for received buffer from module %s",
			handle_rx->name);
		ret = -EINVAL;
	} else {
		uint8_t *data_out = block_rx->data;

		memcpy(block_rx, &msg_tx->block, sizeof(struct aobj_block));
		memcpy(data_out, msg_tx->block.data, msg_tx->block.data_size);

		ret = 0;
	}

	block_release(handle_rx, &msg_tx->block);

	data_fifo_block_free(handle_rx->thread.msg_tx, (void **)&msg_tx);

	return ret;
};

/**
 * @brief Helper function to configure the thread information for the module
 *        set-up parameters structure.
 *
 */
int amod_parameters_configure(struct amod_parameters *parameters,
			      struct amod_description *description, k_thread_stack_t *stack,
			      size_t stack_size, int priority, struct data_fifo *msg_rx,
			      struct data_fifo *msg_tx, struct k_mem_slab *data_slab,
			      size_t data_size)
{
	if (parameters == NULL) {
		LOG_DBG("Error parameters pointer is NULL");
		return -EINVAL;
	}

