gWacey/sdk-nrf/applications/nrf5340_audio/src/audio_modules/generic_module/amod_api.c
	parameters->description = description;
	parameters->thread.stack = stack;
	parameters->thread.stack_size = stack_size;
	parameters->thread.priority = priority;
	parameters->thread.msg_rx = msg_rx;
	parameters->thread.msg_tx = msg_tx;
	parameters->thread.data_slab = data_slab;
	parameters->thread.data_size = data_size;

	return 0;
}

/**
 * @brief Helper function to return the base and instance names for a given
 *        module handle.
 *
 */
int amod_names_get(struct amod_handle *handle, char *base_name, char *instance_name)
{
	if (handle == NULL || base_name == NULL || instance_name == NULL) {
		LOG_DBG("Input parameter is NULL");
		return -EINVAL;
	}

	if (handle->state >= AMOD_STATE_UNDEFINED) {
		LOG_DBG("Module %s is in an invalid state, %d, for get names", handle->name,
			handle->state);
		return -ENOTSUP;
	}

	memcpy(base_name, &handle->description->name, sizeof(handle->description->name));
	memcpy(instance_name, &handle->name, sizeof(handle->name));

	return 0;
}

/**
 * @brief Helper function to return the base and instance names for a given
 *        module handle.
 */
int amod_state_get(struct amod_handle *handle)
{
	if (handle == NULL) {
		LOG_DBG("Input parameter is NULL");
		return -EINVAL;
	}

	if (handle->state >= AMOD_STATE_UNDEFINED) {
		LOG_DBG("Module %s is in an invalid state, %d, for get names", handle->name,
			handle->state);
		return -ENOTSUP;
	}

	return handle->state;
};

/**
 * @brief Helper function to fill an audio data block.
 *
 */
int amod_block_fill(struct aobj_block *block, enum aobj_type data_type, char *data,
		    size_t data_size, struct aobj_format *format, uint32_t reference_ts,
		    uint32_t block_rx_ts, bool bad_frame, bool last_flag, void *user_data)
{
	if (block == NULL) {
		LOG_DBG("Input block parameter is NULL");
		return -EINVAL;
	}

	block->data_type = data_type;
	block->data = data;
	block->data_size = data_size;
	block->format = *format;
	block->reference_ts = reference_ts;
	block->block_rx_ts = block_rx_ts;
	block->bad_frame = bad_frame;
	block->last_flag = last_flag;
	block->user_data = user_data;

	return 0;
};

/**
 * @brief Helper function to extract the audio data from an audio block.
 *
 */
int amod_block_data_extract(struct aobj_block *block, enum aobj_type *data_type, char *data,
			    size_t *data_size, struct aobj_format *format, uint32_t *reference_ts,
			    uint32_t *block_rx_ts, bool *bad_frame, bool *last_flag,
			    void *user_data)
{
	if (block == NULL) {
		LOG_DBG("Input block parameter is NULL");
		return -EINVAL;
	}

	*data_type = block->data_type;
	data = block->data;
	*data_size = block->data_size;
	*format = block->format;
	*reference_ts = block->reference_ts;
	*block_rx_ts = block->block_rx_ts;
	*bad_frame = block->bad_frame;
	*last_flag = block->last_flag;
	user_data = block->user_data;

	return 0;
}
